RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S28/LPC55S28/LPC55S28.xml
        <register>
          <name>USBHS_PHY_TRIM</name>
          <description>USB High Speed Phy Trim values</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>trim_usb_reg_env_tail_adj_vd</name>
              <description>Adjusts time constant of HS RX squelch (envelope) comparator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_usbphy_tx_d_cal</name>
              <description>.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_usbphy_tx_cal45dp</name>
              <description>.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_usbphy_tx_cal45dm</name>
              <description>.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_usb2_refbias_tst</name>
              <description>.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_usb2_refbias_vbgadj</name>
              <description>.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>trim_pll_ctrl0_div_sel</name>
              <description>.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC</description>
      <groupName>PMC</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xD8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ACMP</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Power Management Controller FSM (Finite State Machines) status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xF00FFFFF</resetMask>
          <fields>
            <field>
              <name>BOOTMODE</name>
              <description>Latest IC Boot cause:.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERUP</name>
                  <description>Latest IC boot was a Full power cycle boot sequence (PoR, Pin Reset, Brown Out Detectors Reset, Software Reset).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Latest IC boot was from DEEP SLEEP low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Latest IC boot was from POWER DOWN low power mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>Latest IC boot was from DEEP POWER DOWN low power mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCTRL</name>
          <description>Reset Control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>DPDWAKEUPRESETENABLE</name>
              <description>Wake-up from DEEP POWER DOWN reset event (either from wake up I/O or RTC or OS Event Timer).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Reset event from DEEP POWER DOWN mode is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Reset event from DEEP POWER DOWN mode is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODVBATRESETENABLE</name>
              <description>BOD VBAT reset enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD VBAT reset is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>BOD VBAT reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODCORERESETENABLE</name>
              <description>BOD CORE reset enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD CORE reset is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>BOD CORE reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRRESETENABLE</name>
              <description>Software reset enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Software reset is disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Software reset is enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC0</name>
          <description>DCDC (first) control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10C4E68</resetValue>
          <resetMask>0x7FFFFFF</resetMask>
          <fields>
            <field>
              <name>RC</name>
              <description>Constant On-Time calibration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICOMP</name>
              <description>Select the type of ZCD comparator.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISEL</name>
              <description>Alter Internal biasing currents.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICENABLE</name>
              <description>Selection of auto scaling of COT period with variations in VDD.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TMOS</name>
              <description>One-shot generator reference current trimming signal.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLEISENSE</name>
              <description>Disable Current sensing.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOUT</name>
              <description>Set output regulation voltage.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_DCDC_0P950</name>
                  <description>0.95 V.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_0P975</name>
                  <description>0.975 V.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P000</name>
                  <description>1 V.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P025</name>
                  <description>1.025 V.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P050</name>
                  <description>1.05 V.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P075</name>
                  <description>1.075 V.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P100</name>
                  <description>1.1 V.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P125</name>
                  <description>1.125 V.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P150</name>
                  <description>1.15 V.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P175</name>
                  <description>1.175 V.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_DCDC_1P200</name>
                  <description>1.2 V.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLICINGENABLE</name>
              <description>Enable staggered switching of power switches.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INDUCTORCLAMPENABLE</name>
              <description>Enable shorting of Inductor during PFM idle time.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOUT_PWD</name>
              <description>Set output regulation voltage during Deep Sleep.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDC1</name>
          <description>DCDC (second) control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1803A98</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTRIMOFFET</name>
              <description>Adjust the offset voltage of BJT based comparator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSENSETRIM</name>
              <description>Adjust Max inductor peak current limiting.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTENABLE</name>
              <description>Enable Digital test signals.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETCURVE</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETDC</name>
              <description>Bandgap calibration parameter.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTESTSEL</name>
              <description>Select the output signal for test.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ISCALEENABLE</name>
              <description>Modify COT behavior.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEBYPASS</name>
              <description>Force bypass mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIMAUTOCOT</name>
              <description>Change the scaling ratio of the feedforward compensation.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEFULLCYCLE</name>
              <description>Force full PFM PMOS and NMOS cycle.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCENABLE</name>
              <description>Change the range of the peak detector of current inside the inductor.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFF</name>
              <description>Constant Off-Time calibration input.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOFFENABLE</name>
              <description>Enable Constant Off-Time feature.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
